app/controllers/relationships_controller.rb

SELECT "relationships".* FROM "relationships" WHERE "relationships"."followed_id" = 3 LIMIT 1
SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT 1  [["id", 8]]
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "relationships".* FROM "relationships"
SELECT COUNT(*) FROM "relationships"
---
  def create
    if(params[:commit] == 'Follow')
      #debugger
      if (!Relationship.find_by_followed_id(params[:relationship][:followed_id]))
        current_user.follow(params[:relationship][:followed_id])
	flash[:notice] = "You followed #{User.find(params[:relationship][:followed_id].to_i).email}"

      else
	flash[:notice] = "You are already following #{User.find(params[:relationship][:followed_id].to_i).email}"
      end
      redirect_to("/users")

#######################################################

    else
      # if(params[:commit] == 'UnFollow')
      #debugger
      if(Relationship.count > 0)